11_Rails_Intro_Controller/codealong/bookazon_app/app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author", "genre", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @book = Book.new(book_params)
    if @book.save

UPDATE "books" SET "title" = ?, "genre" = ?, "image_url" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "Robinson Cruzo"], ["genre", "Fiction"], ["image_url", "https://bookcrazes.files.wordpress.com/2011/11/cover1.jpg"], ["updated_at", "2015-09-10 04:20:27.700812"], ["id", 2]]
---
  def update
    @book = get_book
    if @book.update(book_params)