13_Rails_Intro_Model_Associations_Validations/codealong/music_app/app/controllers/artists_controller.rb

  def edit
    @artists = Artist.find(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @artists = Artists.new(article_params)

    if @artist.save
---
INSERT INTO "artists" ("name", "image_url", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    @artist = Artist.find(params[:id])

    if @artist.update(article_params)
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 10]]
UPDATE "artists" SET "description" = ?, "updated_at" = ? WHERE "artists"."id" = ?

  def destroy
    @artist = Artist.find(params[:id])
    @artist.destroy
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "artists" WHERE "artists"."id" = ?  [["id", 3]]